In [1]:
import numpy as np 
import pandas as pd 
import seaborn as sns
from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression

In [4]:
df = pd.read_csv('train.csv')[['Age','Pclass','SibSp','Parch','Survived']]

In [5]:
df.shape

(891, 5)

In [6]:
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Age       714 non-null    float64
 1   Pclass    891 non-null    int64
 2   SibSp     891 non-null    int64
 3   Parch     891 non-null    int64
 4   Survived  891 non-null    int64
dtypes: float64(1), int64(4)
memory usage: 34.9 KB

In [8]:
df.describe()

              Age      Pclass       SibSp       Parch    Survived
count  714.000000  891.000000  891.000000  891.000000  891.000000
mean    29.699118    2.308642    0.523008    0.381594    0.383838
std     14.526497    0.836071    1.102743    0.806057    0.486592
min      0.420000    1.000000    0.000000    0.000000    0.000000
25%     20.125000    2.000000    0.000000    0.000000    0.000000
50%     28.000000    3.000000    0.000000    0.000000    0.000000
75%     38.000000    3.000000    1.000000    0.000000    1.000000
max     80.000000    3.000000    8.000000    6.000000    1.000000

In [9]:
df.cov()

                 Age    Pclass     SibSp     Parch  Survived
Age       211.019125 -4.496004 -4.163334 -2.344191 -0.551296
Pclass     -4.496004  0.699015  0.076599  0.012429 -0.137703
SibSp      -4.163334  0.076599  1.216043  0.368739 -0.018954
Parch      -2.344191  0.012429  0.368739  0.649728  0.032017
Survived   -0.551296 -0.137703 -0.018954  0.032017  0.236772

In [19]:
df.dropna(inplace = True)

In [20]:
X = df.iloc[:,0:4]
y = df.iloc[:,-1]

In [21]:
np.mean(cross_val_score(LogisticRegression(),X,y, error_score='raise',scoring='accuracy',cv=20))

0.6933333333333332

## Applying Feature Contruction

In [22]:
X['Family_size'] = X['SibSp']+X['Parch']+1

In [23]:
X.head()

    Age  Pclass  SibSp  Parch  Family_size
0  22.0       3      1      0            2
1  38.0       1      1      0            2
2  26.0       3      0      0            1
3  35.0       1      1      0            2
4  35.0       3      0      0            1

In [24]:
def myfunc(num):
    if num == 1:
        # alone 
        return 0
    elif num == 1:
        # small family 
        return 1
    else :
        # Large family
        return 2

In [26]:
X['Family_type'] = X['Family_size'].apply(myfunc)

In [27]:
X.sample(5)

      Age  Pclass  SibSp  Parch  Family_size  Family_type
635  28.0       2      0      0            1            0
290  26.0       1      0      0            1            0
259  50.0       2      0      1            2            2
558  39.0       1      1      1            3            2
689  15.0       1      0      1            2            2

In [28]:
np.mean(cross_val_score(LogisticRegression(),X,y,scoring = 'accuracy',cv= 20))

0.7228174603174603

#  Feature splitting

In [29]:
df = pd.read_csv('train.csv')

In [30]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [32]:
df['Title'] = df['Name'].str.split(',',expand = True)[1].str.split('.',expand = True)[0]

In [36]:
df['Title']

0         Mr
1        Mrs
2       Miss
3        Mrs
4         Mr
       ...
886      Rev
887     Miss
888     Miss
889       Mr
890       Mr
Name: Title, Length: 891, dtype: object

In [37]:
df[['Title','Name']]

     Title                                               Name
0       Mr                            Braund, Mr. Owen Harris
1      Mrs  Cumings, Mrs. John Bradley (Florence Briggs Th...
2     Miss                             Heikkinen, Miss. Laina
3      Mrs       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       Mr                           Allen, Mr. William Henry
..     ...                                                ...
886    Rev                              Montvila, Rev. Juozas
887   Miss                       Graham, Miss. Margaret Edith
888   Miss           Johnston, Miss. Catherine Helen "Carrie"
889     Mr                              Behr, Mr. Karl Howell
890     Mr                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [48]:
(df.groupby('Title')['Survived'].mean()).sort_values(ascending =False)

Title
 the Countess    1.000000
 Mlle            1.000000
 Sir             1.000000
 Ms              1.000000
 Lady            1.000000
 Mme             1.000000
 Mrs             0.792000
 Miss            0.697802
 Master          0.575000
 Col             0.500000
 Major           0.500000
 Dr              0.428571
 Mr              0.156673
 Jonkheer        0.000000
 Rev             0.000000
 Don             0.000000
 Capt            0.000000
Name: Survived, dtype: float64

In [55]:
df['Is_Married'] = 0
df['Is_Married'].loc[df['Title']=='Mrs']= 1

C:\Users\sharm\AppData\Local\Temp\ipykernel_37480\1057913879.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Is_Married'].loc[df['Title']=='Mrs']= 1

In [56]:
df['Is_Married'].head()

0    0
1    0
2    0
3    0
4    0
Name: Is_Married, dtype: int64